Bob-the-Kuhn/bootloader_SPI/src/kim/include/stm32g0b1x_defines.h
/*
 * Author: Aurelio Colosimo, 2017
 *
 * This file is part of kim-os project: https://github.com/colosimo/kim-os
 * According to kim-os license, you can do whatever you want with it,
 * as long as you retain this notice.
 */

#ifndef _STM32G0B1X__
#define _STM32G0B1X_

#include <cpu.h>

/* RCC registers */
#define RCC_CR          reg32(0x40021000)
#define RCC_ICSCR       reg32(0x40021004)
#define RCC_CFGR        reg32(0x40021008)
#define RCC_PLLCFGR     reg32(0x4002100C)
#define RCC_RESERVED0   reg32(0x40021010)
#define RCC_CRRCR       reg32(0x40021014)
#define RCC_CIER        reg32(0x40021018)
#define RCC_CIFR        reg32(0x4002101C)
#define RCC_CICR        reg32(0x40021020)
#define RCC_IOPRSTR     reg32(0x40021024)
#define RCC_AHBRSTR     reg32(0x40021028)
#define RCC_APBRSTR1    reg32(0x4002102C)
#define RCC_APBRSTR2    reg32(0x40021030)
#define RCC_IOPENR      reg32(0x40021034)
#define RCC_AHBENR      reg32(0x40021038)
#define RCC_APBENR1     reg32(0x4002103C)
#define RCC_APBENR2     reg32(0x40021040)
#define RCC_IOPSMENR    reg32(0x40021044)
#define RCC_AHBSMENR    reg32(0x40021048)
#define RCC_APBSMENR1   reg32(0x4002104C)
#define RCC_APBSMENR2   reg32(0x40021050)
#define RCC_CCIPR       reg32(0x40021054)
#define RCC_CCIPR2      reg32(0x40021058)
#define RCC_BDCR        reg32(0x4002105C)
#define RCC_CSR         reg32(0x40021060)


/* GPIO registers */
#define R_GPIOA_MODER   reg32(0x50000000)
#define R_GPIOA_OTYPER  reg32(0x50000004)
#define R_GPIOA_OSPEEDR reg32(0x50000008)
#define R_GPIOA_PUPDR   reg32(0x5000000c)
#define R_GPIOA_IDR     reg32(0x50000010)
#define R_GPIOA_ODR     reg32(0x50000014)
#define R_GPIOA_BSRR    reg32(0x50000018)
#define R_GPIOA_LCKR    reg32(0x5000001c)
#define R_GPIOA_AFRL    reg32(0x50000020)
#define R_GPIOA_AFRH    reg32(0x50000024)
#define R_GPIOA_BRR     reg32(0x50000028)

#define R_GPIOB_MODER   reg32(0x50000400)
#define R_GPIOB_OTYPER  reg32(0x50000404)
#define R_GPIOB_OSPEEDR reg32(0x50000408)
#define R_GPIOB_PUPDR   reg32(0x5000040c)
#define R_GPIOB_IDR     reg32(0x50000410)
#define R_GPIOB_ODR     reg32(0x50000414)
#define R_GPIOB_BSRR    reg32(0x50000418)
#define R_GPIOB_LCKR    reg32(0x5000041c)
#define R_GPIOB_AFRL    reg32(0x50000420)
#define R_GPIOB_AFRH    reg32(0x50000424)
#define R_GPIOB_BRR     reg32(0x50000428)

#define R_GPIOC_MODER   reg32(0x50000800)
#define R_GPIOC_OTYPER  reg32(0x50000804)
#define R_GPIOC_OSPEEDR reg32(0x50000808)
#define R_GPIOC_PUPDR   reg32(0x5000080c)
#define R_GPIOC_IDR     reg32(0x50000810)
#define R_GPIOC_ODR     reg32(0x50000814)
#define R_GPIOC_BSRR    reg32(0x50000818)
#define R_GPIOC_LCKR    reg32(0x5000081c)
#define R_GPIOC_AFRL    reg32(0x50000820)
#define R_GPIOC_AFRH    reg32(0x50000824)
#define R_GPIOC_BRR     reg32(0x50000828)

#define R_GPIOD_MODER   reg32(0x50000c00)
#define R_GPIOD_OTYPER  reg32(0x50000c04)
#define R_GPIOD_OSPEEDR reg32(0x50000c08)
#define R_GPIOD_PUPDR   reg32(0x50000c0c)
#define R_GPIOD_IDR     reg32(0x50000c10)
#define R_GPIOD_ODR     reg32(0x50000c14)
#define R_GPIOD_BSRR    reg32(0x50000c18)
#define R_GPIOD_LCKR    reg32(0x50000c1c)
#define R_GPIOD_AFRL    reg32(0x50000c20)
#define R_GPIOD_AFRH    reg32(0x50000c24)
#define R_GPIOD_BRR     reg32(0x50000c28)

#define R_GPIOE_MODER   reg32(0x50001000)
#define R_GPIOE_OTYPER  reg32(0x50001004)
#define R_GPIOE_OSPEEDR reg32(0x50001008)
#define R_GPIOE_PUPDR   reg32(0x5000100c)
#define R_GPIOE_IDR     reg32(0x50001010)
#define R_GPIOE_ODR     reg32(0x50001014)
#define R_GPIOE_BSRR    reg32(0x50001018)
#define R_GPIOE_LCKR    reg32(0x5000101c)
#define R_GPIOE_AFRL    reg32(0x50001020)
#define R_GPIOE_AFRH    reg32(0x50001024)
#define R_GPIOE_BRR     reg32(0x50001028)

#define R_GPIOF_MODER   reg32(0x50001400)
#define R_GPIOF_OTYPER  reg32(0x50001404)
#define R_GPIOF_OSPEEDR reg32(0x50001408)
#define R_GPIOF_PUPDR   reg32(0x5000140c)
#define R_GPIOF_IDR     reg32(0x50001410)
#define R_GPIOF_ODR     reg32(0x50001414)
#define R_GPIOF_BSRR    reg32(0x50001418)
#define R_GPIOF_LCKR    reg32(0x5000141c)
#define R_GPIOF_AFRL    reg32(0x50001420)
#define R_GPIOF_AFRH    reg32(0x50001424)
#define R_GPIOF_BRR     reg32(0x50001428)

/* USART registers */
#define R_USART1_CR1    reg32(0x40013800)    /*!< USART Control register 1,                 Address offset: 0x00  */
#define R_USART1_CR2    reg32(0x40013804)    /*!< USART Control register 2,                 Address offset: 0x04  */
#define R_USART1_CR3    reg32(0x40013808)    /*!< USART Control register 3,                 Address offset: 0x08  */
#define R_USART1_BRR    reg32(0x4001380C)    /*!< USART Baud rate register,                 Address offset: 0x0C  */
#define R_USART1_GTPR   reg32(0x40013810)    /*!< USART Guard time and prescaler register,  Address offset: 0x10  */
#define R_USART1_RTOR   reg32(0x40013814)    /*!< USART Receiver Time Out register,         Address offset: 0x14  */
#define R_USART1_RQR    reg32(0x40013818)    /*!< USART Request register,                   Address offset: 0x18  */
#define R_USART1_ISR    reg32(0x4001381C)    /*!< USART Interrupt and status register,      Address offset: 0x1C  */
#define R_USART1_ICR    reg32(0x40013820)    /*!< USART Interrupt flag Clear register,      Address offset: 0x20  */
#define R_USART1_RDR    reg32(0x40013824)    /*!< USART Receive Data register,              Address offset: 0x24  */
#define R_USART1_TDR    reg32(0x40013828)    /*!< USART Transmit Data register,             Address offset: 0x28  */
#define R_USART1_PRESC  reg32(0x4001382C)    /*!< USART Prescaler register,                 Address offset: 0x2C  */

#define R_USART2_CR1    reg32(0x40004400)    /*!< USART Control register 1,                 Address offset: 0x00  */
#define R_USART2_CR2    reg32(0x40004404)    /*!< USART Control register 2,                 Address offset: 0x04  */
#define R_USART2_CR3    reg32(0x40004408)    /*!< USART Control register 3,                 Address offset: 0x08  */
#define R_USART2_BRR    reg32(0x4000440C)    /*!< USART Baud rate register,                 Address offset: 0x0C  */
#define R_USART2_GTPR   reg32(0x40004410)    /*!< USART Guard time and prescaler register,  Address offset: 0x10  */
#define R_USART2_RTOR   reg32(0x40004414)    /*!< USART Receiver Time Out register,         Address offset: 0x14  */
#define R_USART2_RQR    reg32(0x40004418)    /*!< USART Request register,                   Address offset: 0x18  */
#define R_USART2_ISR    reg32(0x4000441C)    /*!< USART Interrupt and status register,      Address offset: 0x1C  */
#define R_USART2_ICR    reg32(0x40004420)    /*!< USART Interrupt flag Clear register,      Address offset: 0x20  */
#define R_USART2_RDR    reg32(0x40004424)    /*!< USART Receive Data register,              Address offset: 0x24  */
#define R_USART2_TDR    reg32(0x40004428)    /*!< USART Transmit Data register,             Address offset: 0x28  */
#define R_USART2_PRESC  reg32(0x4000442C)    /*!< USART Prescaler register,                 Address offset: 0x2C  */

