Bob-the-Kuhn/bootloader_SPI/src/kim/include/stm32g0b1x_defines.h
#define R_USART3_CR1    reg32(0x40004800)    /*!< USART Control register 1,                 Address offset: 0x00  */
#define R_USART3_CR2    reg32(0x40004804)    /*!< USART Control register 2,                 Address offset: 0x04  */
#define R_USART3_CR3    reg32(0x40004808)    /*!< USART Control register 3,                 Address offset: 0x08  */
#define R_USART3_BRR    reg32(0x4000480C)    /*!< USART Baud rate register,                 Address offset: 0x0C  */
#define R_USART3_GTPR   reg32(0x40004810)    /*!< USART Guard time and prescaler register,  Address offset: 0x10  */
#define R_USART3_RTOR   reg32(0x40004814)    /*!< USART Receiver Time Out register,         Address offset: 0x14  */
#define R_USART3_RQR    reg32(0x40004818)    /*!< USART Request register,                   Address offset: 0x18  */
#define R_USART3_ISR    reg32(0x4000481C)    /*!< USART Interrupt and status register,      Address offset: 0x1C  */
#define R_USART3_ICR    reg32(0x40004820)    /*!< USART Interrupt flag Clear register,      Address offset: 0x20  */
#define R_USART3_RDR    reg32(0x40004824)    /*!< USART Receive Data register,              Address offset: 0x24  */
#define R_USART3_TDR    reg32(0x40004828)    /*!< USART Transmit Data register,             Address offset: 0x28  */
#define R_USART3_PRESC  reg32(0x4000482C)    /*!< USART Prescaler register,                 Address offset: 0x2C  */

#define R_USART4_CR1    reg32(0x40004C00)    /*!< USART Control register 1,                 Address offset: 0x00  */
#define R_USART4_CR2    reg32(0x40004C04)    /*!< USART Control register 2,                 Address offset: 0x04  */
#define R_USART4_CR3    reg32(0x40004C08)    /*!< USART Control register 3,                 Address offset: 0x08  */
#define R_USART4_BRR    reg32(0x40004C0C)    /*!< USART Baud rate register,                 Address offset: 0x0C  */
#define R_USART4_GTPR   reg32(0x40004C10)    /*!< USART Guard time and prescaler register,  Address offset: 0x10  */
#define R_USART4_RTOR   reg32(0x40004C14)    /*!< USART Receiver Time Out register,         Address offset: 0x14  */
#define R_USART4_RQR    reg32(0x40004C18)    /*!< USART Request register,                   Address offset: 0x18  */
#define R_USART4_ISR    reg32(0x40004C1C)    /*!< USART Interrupt and status register,      Address offset: 0x1C  */
#define R_USART4_ICR    reg32(0x40004C20)    /*!< USART Interrupt flag Clear register,      Address offset: 0x20  */
#define R_USART4_RDR    reg32(0x40004C24)    /*!< USART Receive Data register,              Address offset: 0x24  */
#define R_USART4_TDR    reg32(0x40004C28)    /*!< USART Transmit Data register,             Address offset: 0x28  */
#define R_USART4_PRESC  reg32(0x40004C2C)    /*!< USART Prescaler register,                 Address offset: 0x2C  */

#define R_USART5_CR1    reg32(0x40005000)    /*!< USART Control register 1,                 Address offset: 0x00  */
#define R_USART5_CR2    reg32(0x40005004)    /*!< USART Control register 2,                 Address offset: 0x04  */
#define R_USART5_CR3    reg32(0x40005008)    /*!< USART Control register 3,                 Address offset: 0x08  */
#define R_USART5_BRR    reg32(0x4000500C)    /*!< USART Baud rate register,                 Address offset: 0x0C  */
#define R_USART5_GTPR   reg32(0x40005010)    /*!< USART Guard time and prescaler register,  Address offset: 0x10  */
#define R_USART5_RTOR   reg32(0x40005014)    /*!< USART Receiver Time Out register,         Address offset: 0x14  */
#define R_USART5_RQR    reg32(0x40005018)    /*!< USART Request register,                   Address offset: 0x18  */
#define R_USART5_ISR    reg32(0x4000501C)    /*!< USART Interrupt and status register,      Address offset: 0x1C  */
#define R_USART5_ICR    reg32(0x40005020)    /*!< USART Interrupt flag Clear register,      Address offset: 0x20  */
#define R_USART5_RDR    reg32(0x40005024)    /*!< USART Receive Data register,              Address offset: 0x24  */
#define R_USART5_TDR    reg32(0x40005028)    /*!< USART Transmit Data register,             Address offset: 0x28  */
#define R_USART5_PRESC  reg32(0x4000502C)    /*!< USART Prescaler register,                 Address offset: 0x2C  */

#define R_USART6_CR1    reg32(0x40013C00)    /*!< USART Control register 1,                 Address offset: 0x00  */
#define R_USART6_CR2    reg32(0x40013C04)    /*!< USART Control register 2,                 Address offset: 0x04  */
#define R_USART6_CR3    reg32(0x40013C08)    /*!< USART Control register 3,                 Address offset: 0x08  */
#define R_USART6_BRR    reg32(0x40013C0C)    /*!< USART Baud rate register,                 Address offset: 0x0C  */
#define R_USART6_GTPR   reg32(0x40013C10)    /*!< USART Guard time and prescaler register,  Address offset: 0x10  */
#define R_USART6_RTOR   reg32(0x40013C14)    /*!< USART Receiver Time Out register,         Address offset: 0x14  */
#define R_USART6_RQR    reg32(0x40013C18)    /*!< USART Request register,                   Address offset: 0x18  */
#define R_USART6_ISR    reg32(0x40013C1C)    /*!< USART Interrupt and status register,      Address offset: 0x1C  */
#define R_USART6_ICR    reg32(0x40013C20)    /*!< USART Interrupt flag Clear register,      Address offset: 0x20  */
#define R_USART6_RDR    reg32(0x40013C24)    /*!< USART Receive Data register,              Address offset: 0x24  */
#define R_USART6_TDR    reg32(0x40013C28)    /*!< USART Transmit Data register,             Address offset: 0x28  */
#define R_USART6_PRESC  reg32(0x40013C2C)    /*!< USART Prescaler register,                 Address offset: 0x2C  */



/* Flash interface registers */
#define R_FLASH_ACR         reg32(0x40022000)    /*!< FLASH Access Control register,                     Address offset: 0x00 */
#define R_FLASH_KEYR        reg32(0x40022008)    /*!< FLASH Key register,                                Address offset: 0x08 */
#define R_FLASH_OPTKEYR     reg32(0x4002200C)    /*!< FLASH Option Key register,                         Address offset: 0x0C */
#define R_FLASH_SR          reg32(0x40022010)    /*!< FLASH Status register,                             Address offset: 0x10 */
#define R_FLASH_CR          reg32(0x40022014)    /*!< FLASH Control register,                            Address offset: 0x14 */
#define R_FLASH_ECCR        reg32(0x40022018)    /*!< FLASH ECC bank 1 register,                         Address offset: 0x18 */
#define R_FLASH_ECC2R       reg32(0x4002201C)    /*!< FLASH ECC bank 2 register,                         Address offset: 0x1C */
#define R_FLASH_OPTR        reg32(0x40022020)    /*!< FLASH Option register,                             Address offset: 0x20 */
#define R_FLASH_PCROP1ASR   reg32(0x40022024)    /*!< FLASH Bank PCROP area A Start address register,    Address offset: 0x24 */
#define R_FLASH_PCROP1AER   reg32(0x40022028)    /*!< FLASH Bank PCROP area A End address register,      Address offset: 0x28 */
#define R_FLASH_WRP1AR      reg32(0x4002202C)    /*!< FLASH Bank WRP area A address register,            Address offset: 0x2C */
#define R_FLASH_WRP1BR      reg32(0x40022030)    /*!< FLASH Bank WRP area B address register,            Address offset: 0x30 */
#define R_FLASH_PCROP1BSR   reg32(0x40022034)    /*!< FLASH Bank PCROP area B Start address register,    Address offset: 0x34 */
#define R_FLASH_PCROP1BER   reg32(0x40022038)    /*!< FLASH Bank PCROP area B End address register,      Address offset: 0x38 */
#define R_FLASH_PCROP2ASR   reg32(0x40022044)    /*!< FLASH Bank2 PCROP area A Start address register,   Address offset: 0x44 */
#define R_FLASH_PCROP2AER   reg32(0x40022048)    /*!< FLASH Bank2 PCROP area A End address register,     Address offset: 0x48 */
#define R_FLASH_WRP2AR      reg32(0x4002204C)    /*!< FLASH Bank2 WRP area A address register,           Address offset: 0x4C */
#define R_FLASH_WRP2BR      reg32(0x40022050)    /*!< FLASH Bank2 WRP area B address register,           Address offset: 0x50 */
#define R_FLASH_PCROP2BSR   reg32(0x40022054)    /*!< FLASH Bank2 PCROP area B Start address register,   Address offset: 0x54 */
#define R_FLASH_PCROP2BER   reg32(0x40022058)    /*!< FLASH Bank2 PCROP area B End address register,     Address offset: 0x58 */
#define R_FLASH_SECR        reg32(0x40022080)    /*!< FLASH security register ,                          Address offset: 0x80 */


/* TIM1 registers */
#define R_TIM1_CR1      reg16(0x40012C00)  /*!< TIM control register 1,                   Address offset: 0x00 */
#define R_TIM1_CR2      reg16(0x40012C04)  /*!< TIM control register 2,                   Address offset: 0x04 */
#define R_TIM1_SMCR     reg16(0x40012C08)  /*!< TIM slave mode control register,          Address offset: 0x08 */
#define R_TIM1_DIER     reg16(0x40012C0C)  /*!< TIM DMA/interrupt enable register,        Address offset: 0x0C */
#define R_TIM1_SR       reg16(0x40012C10)  /*!< TIM status register,                      Address offset: 0x10 */
#define R_TIM1_EGR      reg16(0x40012C14)  /*!< TIM event generation register,            Address offset: 0x14 */
#define R_TIM1_CCMR1    reg16(0x40012C18)  /*!< TIM capture/compare mode register 1,      Address offset: 0x18 */
#define R_TIM1_CCMR2    reg16(0x40012C1C)  /*!< TIM capture/compare mode register 2,      Address offset: 0x1C */
#define R_TIM1_CCER     reg16(0x40012C20)  /*!< TIM capture/compare enable register,      Address offset: 0x20 */
#define R_TIM1_CNT      reg16(0x40012C24)  /*!< TIM counter register,                     Address offset: 0x24 */
#define R_TIM1_PSC      reg16(0x40012C28)  /*!< TIM prescaler register,                   Address offset: 0x28 */
#define R_TIM1_ARR      reg16(0x40012C2C)  /*!< TIM auto-reload register,                 Address offset: 0x2C */
#define R_TIM1_RCR      reg16(0x40012C30)  /*!< TIM repetition counter register,          Address offset: 0x30 */
#define R_TIM1_CCR1     reg16(0x40012C34)  /*!< TIM capture/compare register 1,           Address offset: 0x34 */
#define R_TIM1_CCR2     reg16(0x40012C38)  /*!< TIM capture/compare register 2,           Address offset: 0x38 */
#define R_TIM1_CCR3     reg16(0x40012C3C)  /*!< TIM capture/compare register 3,           Address offset: 0x3C */
#define R_TIM1_CCR4     reg16(0x40012C40)  /*!< TIM capture/compare register 4,           Address offset: 0x40 */
#define R_TIM1_BDTR     reg16(0x40012C44)  /*!< TIM break and dead-time register,         Address offset: 0x44 */
#define R_TIM1_DCR      reg16(0x40012C48)  /*!< TIM DMA control register,                 Address offset: 0x48 */
#define R_TIM1_DMAR     reg16(0x40012C4C)  /*!< TIM DMA address for full transfer,        Address offset: 0x4C */
#define R_TIM1_OR1      reg16(0x40012C50)  /*!< TIM option register,                      Address offset: 0x50 */
#define R_TIM1_CCMR3    reg16(0x40012C54)  /*!< TIM capture/compare mode register 3,      Address offset: 0x54 */
#define R_TIM1_CCR5     reg16(0x40012C58)  /*!< TIM capture/compare register5,            Address offset: 0x58 */
#define R_TIM1_CCR6     reg16(0x40012C5C)  /*!< TIM capture/compare register6,            Address offset: 0x5C */
#define R_TIM1_AF1      reg16(0x40012C60)  /*!< TIM alternate function register 1,        Address offset: 0x60 */
#define R_TIM1_AF2      reg16(0x40012C64)  /*!< TIM alternate function register 2,        Address offset: 0x64 */
#define R_TIM1_TISEL    reg16(0x40012C68)  /*!< TIM Input Selection register,             Address offset: 0x68 */

