Bob-the-Kuhn/bootloader_SPI/src/kim/include/stm32g0b1x_defines.h
#define R_TIM2_CR1      reg16(0x40000000)  /*!< TIM control register 1,                   Address offset: 0x00 */
#define R_TIM2_CR2      reg16(0x40000004)  /*!< TIM control register 2,                   Address offset: 0x04 */
#define R_TIM2_SMCR     reg16(0x40000008)  /*!< TIM slave mode control register,          Address offset: 0x08 */
#define R_TIM2_DIER     reg16(0x4000000C)  /*!< TIM DMA/interrupt enable register,        Address offset: 0x0C */
#define R_TIM2_SR       reg16(0x40000010)  /*!< TIM status register,                      Address offset: 0x10 */
#define R_TIM2_EGR      reg16(0x40000014)  /*!< TIM event generation register,            Address offset: 0x14 */
#define R_TIM2_CCMR1    reg16(0x40000018)  /*!< TIM capture/compare mode register 1,      Address offset: 0x18 */
#define R_TIM2_CCMR2    reg16(0x4000001C)  /*!< TIM capture/compare mode register 2,      Address offset: 0x1C */
#define R_TIM2_CCER     reg16(0x40000020)  /*!< TIM capture/compare enable register,      Address offset: 0x20 */
#define R_TIM2_CNT      reg16(0x40000024)  /*!< TIM counter register,                     Address offset: 0x24 */
#define R_TIM2_PSC      reg16(0x40000028)  /*!< TIM prescaler register,                   Address offset: 0x28 */
#define R_TIM2_ARR      reg16(0x4000002C)  /*!< TIM auto-reload register,                 Address offset: 0x2C */
#define R_TIM2_RCR      reg16(0x40000030)  /*!< TIM repetition counter register,          Address offset: 0x30 */
#define R_TIM2_CCR1     reg16(0x40000034)  /*!< TIM capture/compare register 1,           Address offset: 0x34 */
#define R_TIM2_CCR2     reg16(0x40000038)  /*!< TIM capture/compare register 2,           Address offset: 0x38 */
#define R_TIM2_CCR3     reg16(0x4000003C)  /*!< TIM capture/compare register 3,           Address offset: 0x3C */
#define R_TIM2_CCR4     reg16(0x40000040)  /*!< TIM capture/compare register 4,           Address offset: 0x40 */
#define R_TIM2_BDTR     reg16(0x40000044)  /*!< TIM break and dead-time register,         Address offset: 0x44 */
#define R_TIM2_DCR      reg16(0x40000048)  /*!< TIM DMA control register,                 Address offset: 0x48 */
#define R_TIM2_DMAR     reg16(0x4000004C)  /*!< TIM DMA address for full transfer,        Address offset: 0x4C */
#define R_TIM2_OR1      reg16(0x40000050)  /*!< TIM option register,                      Address offset: 0x50 */
#define R_TIM2_CCMR3    reg16(0x40000054)  /*!< TIM capture/compare mode register 3,      Address offset: 0x54 */
#define R_TIM2_CCR5     reg16(0x40000058)  /*!< TIM capture/compare register5,            Address offset: 0x58 */
#define R_TIM2_CCR6     reg16(0x4000005C)  /*!< TIM capture/compare register6,            Address offset: 0x5C */
#define R_TIM2_AF1      reg16(0x40000060)  /*!< TIM alternate function register 1,        Address offset: 0x60 */
#define R_TIM2_AF2      reg16(0x40000064)  /*!< TIM alternate function register 2,        Address offset: 0x64 */
#define R_TIM2_TISEL    reg16(0x40000068)  /*!< TIM Input Selection register,             Address offset: 0x68 */

#define R_TIM3_CR1      reg16(0x40000400)  /*!< TIM control register 1,                   Address offset: 0x00 */
#define R_TIM3_CR2      reg16(0x40000404)  /*!< TIM control register 2,                   Address offset: 0x04 */
#define R_TIM3_SMCR     reg16(0x40000408)  /*!< TIM slave mode control register,          Address offset: 0x08 */
#define R_TIM3_DIER     reg16(0x4000040C)  /*!< TIM DMA/interrupt enable register,        Address offset: 0x0C */
#define R_TIM3_SR       reg16(0x40000410)  /*!< TIM status register,                      Address offset: 0x10 */
#define R_TIM3_EGR      reg16(0x40000414)  /*!< TIM event generation register,            Address offset: 0x14 */
#define R_TIM3_CCMR1    reg16(0x40000418)  /*!< TIM capture/compare mode register 1,      Address offset: 0x18 */
#define R_TIM3_CCMR2    reg16(0x4000041C)  /*!< TIM capture/compare mode register 2,      Address offset: 0x1C */
#define R_TIM3_CCER     reg16(0x40000420)  /*!< TIM capture/compare enable register,      Address offset: 0x20 */
#define R_TIM3_CNT      reg16(0x40000424)  /*!< TIM counter register,                     Address offset: 0x24 */
#define R_TIM3_PSC      reg16(0x40000428)  /*!< TIM prescaler register,                   Address offset: 0x28 */
#define R_TIM3_ARR      reg16(0x4000042C)  /*!< TIM auto-reload register,                 Address offset: 0x2C */
#define R_TIM3_RCR      reg16(0x40000430)  /*!< TIM repetition counter register,          Address offset: 0x30 */
#define R_TIM3_CCR1     reg16(0x40000434)  /*!< TIM capture/compare register 1,           Address offset: 0x34 */
#define R_TIM3_CCR2     reg16(0x40000438)  /*!< TIM capture/compare register 2,           Address offset: 0x38 */
#define R_TIM3_CCR3     reg16(0x4000043C)  /*!< TIM capture/compare register 3,           Address offset: 0x3C */
#define R_TIM3_CCR4     reg16(0x40000440)  /*!< TIM capture/compare register 4,           Address offset: 0x40 */
#define R_TIM3_BDTR     reg16(0x40000444)  /*!< TIM break and dead-time register,         Address offset: 0x44 */
#define R_TIM3_DCR      reg16(0x40000448)  /*!< TIM DMA control register,                 Address offset: 0x48 */
#define R_TIM3_DMAR     reg16(0x4000044C)  /*!< TIM DMA address for full transfer,        Address offset: 0x4C */
#define R_TIM3_OR1      reg16(0x40000450)  /*!< TIM option register,                      Address offset: 0x50 */
#define R_TIM3_CCMR3    reg16(0x40000454)  /*!< TIM capture/compare mode register 3,      Address offset: 0x54 */
#define R_TIM3_CCR5     reg16(0x40000458)  /*!< TIM capture/compare register5,            Address offset: 0x58 */
#define R_TIM3_CCR6     reg16(0x4000045C)  /*!< TIM capture/compare register6,            Address offset: 0x5C */
#define R_TIM3_AF1      reg16(0x40000460)  /*!< TIM alternate function register 1,        Address offset: 0x60 */
#define R_TIM3_AF2      reg16(0x40000464)  /*!< TIM alternate function register 2,        Address offset: 0x64 */
#define R_TIM3_TISEL    reg16(0x40000468)  /*!< TIM Input Selection register,             Address offset: 0x68 */

#define R_TIM4_CR1      reg16(0x40000800)  /*!< TIM control register 1,                   Address offset: 0x00 */
#define R_TIM4_CR2      reg16(0x40000804)  /*!< TIM control register 2,                   Address offset: 0x04 */
#define R_TIM4_SMCR     reg16(0x40000808)  /*!< TIM slave mode control register,          Address offset: 0x08 */
#define R_TIM4_DIER     reg16(0x4000080C)  /*!< TIM DMA/interrupt enable register,        Address offset: 0x0C */
#define R_TIM4_SR       reg16(0x40000810)  /*!< TIM status register,                      Address offset: 0x10 */
#define R_TIM4_EGR      reg16(0x40000814)  /*!< TIM event generation register,            Address offset: 0x14 */
#define R_TIM4_CCMR1    reg16(0x40000818)  /*!< TIM capture/compare mode register 1,      Address offset: 0x18 */
#define R_TIM4_CCMR2    reg16(0x4000081C)  /*!< TIM capture/compare mode register 2,      Address offset: 0x1C */
#define R_TIM4_CCER     reg16(0x40000820)  /*!< TIM capture/compare enable register,      Address offset: 0x20 */
#define R_TIM4_CNT      reg16(0x40000824)  /*!< TIM counter register,                     Address offset: 0x24 */
#define R_TIM4_PSC      reg16(0x40000828)  /*!< TIM prescaler register,                   Address offset: 0x28 */
#define R_TIM4_ARR      reg16(0x4000082C)  /*!< TIM auto-reload register,                 Address offset: 0x2C */
#define R_TIM4_RCR      reg16(0x40000830)  /*!< TIM repetition counter register,          Address offset: 0x30 */
#define R_TIM4_CCR1     reg16(0x40000834)  /*!< TIM capture/compare register 1,           Address offset: 0x34 */
#define R_TIM4_CCR2     reg16(0x40000838)  /*!< TIM capture/compare register 2,           Address offset: 0x38 */
#define R_TIM4_CCR3     reg16(0x4000083C)  /*!< TIM capture/compare register 3,           Address offset: 0x3C */
#define R_TIM4_CCR4     reg16(0x40000840)  /*!< TIM capture/compare register 4,           Address offset: 0x40 */
#define R_TIM4_BDTR     reg16(0x40000844)  /*!< TIM break and dead-time register,         Address offset: 0x44 */
#define R_TIM4_DCR      reg16(0x40000848)  /*!< TIM DMA control register,                 Address offset: 0x48 */
#define R_TIM4_DMAR     reg16(0x4000084C)  /*!< TIM DMA address for full transfer,        Address offset: 0x4C */
#define R_TIM4_OR1      reg16(0x40000850)  /*!< TIM option register,                      Address offset: 0x50 */
#define R_TIM4_CCMR3    reg16(0x40000854)  /*!< TIM capture/compare mode register 3,      Address offset: 0x54 */
#define R_TIM4_CCR5     reg16(0x40000858)  /*!< TIM capture/compare register5,            Address offset: 0x58 */
#define R_TIM4_CCR6     reg16(0x4000085C)  /*!< TIM capture/compare register6,            Address offset: 0x5C */
#define R_TIM4_AF1      reg16(0x40000860)  /*!< TIM alternate function register 1,        Address offset: 0x60 */
#define R_TIM4_AF2      reg16(0x40000864)  /*!< TIM alternate function register 2,        Address offset: 0x64 */
#define R_TIM4_TISEL    reg16(0x40000868)  /*!< TIM Input Selection register,             Address offset: 0x68 */


/* Generic offset for TIM registers */
#define R_TIMx_CR1(base)   reg16((((u32)base) + 0x00)
#define R_TIMx_CR2(base)   reg16((((u32)base) + 0x04)
#define R_TIMx_SMCR(base)  reg16((((u32)base) + 0x08)
#define R_TIMx_DIER(base)  reg16((((u32)base) + 0x0c)
#define R_TIMx_SR(base)    reg16((((u32)base) + 0x10)
#define R_TIMx_EGR(base)   reg16((((u32)base) + 0x14)
#define R_TIMx_CCMR1(base) reg16(((u32)base) + 0x18)
#define R_TIMx_CCMR2(base) reg16(((u32)base) + 0x1c)
#define R_TIMx_CCER(base)  reg16(((u32)base) + 0x20)
#define R_TIMx_CNT(base)   reg16(((u32)base) + 0x24)
#define R_TIMx_PSC(base)   reg16(((u32)base) + 0x28)
#define R_TIMx_ARR(base)   reg16(((u32)base) + 0x2c)
#define R_TIMx_RCR(base)   reg16(((u32)base) + 0x30)
#define R_TIMx_CCR1(base)  reg16(((u32)base) + 0x34)
#define R_TIMx_CCR2(base)  reg16(((u32)base) + 0x38)
#define R_TIMx_CCR3(base)  reg16(((u32)base) + 0x3c)
#define R_TIMx_CCR4(base)  reg16(((u32)base) + 0x40)
#define R_TIMx_BDTR(base)  reg16(((u32)base) + 0x44)
#define R_TIMx_DCR(base)   reg16(((u32)base) + 0x48)
#define R_TIMx_DMAR(base)  reg16(((u32)base) + 0x4c)
#define R_TIMx_OR1(base)   reg16(((u32)base) + 0x50)
#define R_TIMx_CCMR3(base) reg16(((u32)base) + 0x54)
#define R_TIMx_CCR5(base)  reg16(((u32)base) + 0x58)
#define R_TIMx_CCR6(base)  reg16(((u32)base) + 0x5C)
#define R_TIMx_AF1(base)   reg16(((u32)base) + 0x60)
#define R_TIMx_AF2(base)   reg16(((u32)base) + 0x64)
#define R_TIMx_TISEL(base) reg16(((u32)base) + 0x68)


/* I2C registers */
#define R_I2C1_CR1        reg16(0x40005400)  /*!< I2C Control register 1,            Address offset: 0x00 */
#define R_I2C1_CR2        reg16(0x40005404)  /*!< I2C Control register 2,            Address offset: 0x04 */
#define R_I2C1_OAR1       reg16(0x40005408)  /*!< I2C Own address 1 register,        Address offset: 0x08 */
#define R_I2C1_OAR2       reg16(0x4000540C)  /*!< I2C Own address 2 register,        Address offset: 0x0C */
#define R_I2C1_TIMINGR    reg16(0x40005410)  /*!< I2C Timing register,               Address offset: 0x10 */
#define R_I2C1_TIMEOUTR   reg16(0x40005414)  /*!< I2C Timeout register,              Address offset: 0x14 */
#define R_I2C1_ISR        reg16(0x40005418)  /*!< I2C Interrupt and status register, Address offset: 0x18 */
#define R_I2C1_ICR        reg16(0x4000541C)  /*!< I2C Interrupt clear register,      Address offset: 0x1C */
#define R_I2C1_PECR       reg16(0x40005420)  /*!< I2C PEC register,                  Address offset: 0x20 */
#define R_I2C1_RXDR       reg16(0x40005424)  /*!< I2C Receive data register,         Address offset: 0x24 */
#define R_I2C1_TXDR       reg16(0x40005428)  /*!< I2C Transmit data register,        Address offset: 0x28 */

#define R_I2C2_CR1        reg16(0x40005800)  /*!< I2C Control register 1,            Address offset: 0x00 */
#define R_I2C2_CR2        reg16(0x40005804)  /*!< I2C Control register 2,            Address offset: 0x04 */
#define R_I2C2_OAR1       reg16(0x40005808)  /*!< I2C Own address 1 register,        Address offset: 0x08 */
#define R_I2C2_OAR2       reg16(0x4000580C)  /*!< I2C Own address 2 register,        Address offset: 0x0C */
#define R_I2C2_TIMINGR    reg16(0x40005810)  /*!< I2C Timing register,               Address offset: 0x10 */
#define R_I2C2_TIMEOUTR   reg16(0x40005814)  /*!< I2C Timeout register,              Address offset: 0x14 */
#define R_I2C2_ISR        reg16(0x40005818)  /*!< I2C Interrupt and status register, Address offset: 0x18 */
#define R_I2C2_ICR        reg16(0x4000581C)  /*!< I2C Interrupt clear register,      Address offset: 0x1C */
#define R_I2C2_PECR       reg16(0x40005820)  /*!< I2C PEC register,                  Address offset: 0x20 */
#define R_I2C2_RXDR       reg16(0x40005824)  /*!< I2C Receive data register,         Address offset: 0x24 */
#define R_I2C2_TXDR       reg16(0x40005828)  /*!< I2C Transmit data register,        Address offset: 0x28 */

