Bob-the-Kuhn/bootloader_SPI/src/kim/include/stm32g0b1x_defines.h
#define R_I2C3_CR1        reg16(0x40008800)  /*!< I2C Control register 1,            Address offset: 0x00 */
#define R_I2C3_CR2        reg16(0x40008804)  /*!< I2C Control register 2,            Address offset: 0x04 */
#define R_I2C3_OAR1       reg16(0x40008808)  /*!< I2C Own address 1 register,        Address offset: 0x08 */
#define R_I2C3_OAR2       reg16(0x4000880C)  /*!< I2C Own address 2 register,        Address offset: 0x0C */
#define R_I2C3_TIMINGR    reg16(0x40008810)  /*!< I2C Timing register,               Address offset: 0x10 */
#define R_I2C3_TIMEOUTR   reg16(0x40008814)  /*!< I2C Timeout register,              Address offset: 0x14 */
#define R_I2C3_ISR        reg16(0x40008818)  /*!< I2C Interrupt and status register, Address offset: 0x18 */
#define R_I2C3_ICR        reg16(0x4000881C)  /*!< I2C Interrupt clear register,      Address offset: 0x1C */
#define R_I2C3_PECR       reg16(0x40008820)  /*!< I2C PEC register,                  Address offset: 0x20 */
#define R_I2C3_RXDR       reg16(0x40008824)  /*!< I2C Receive data register,         Address offset: 0x24 */
#define R_I2C3_TXDR       reg16(0x40008828)  /*!< I2C Transmit data register,        Address offset: 0x28 */
  
#define R_I2C_CR1(x)    reg16(0x40005400 + x * 0x400)
#define R_I2C_CR2(x)    reg16(0x40005404 + x * 0x400)
#define R_I2C_OAR1(x)   reg16(0x40005408 + x * 0x400)
#define R_I2C_OAR2(x)   reg16(0x4000540c + x * 0x400)
#define R_I2C_DR(x)     reg16(0x40005410 + x * 0x400)
#define R_I2C_SR1(x)    reg16(0x40005414 + x * 0x400)
#define R_I2C_SR2(x)    reg16(0x40005418 + x * 0x400)
#define R_I2C_CCR(x)    reg16(0x4000541c + x * 0x400)
#define R_I2C_TRISE(x)  reg16(0x40005420 + x * 0x400)
#define R_I2C_FLTR(x)   reg16(0x40005424 + x * 0x400)

/* SPI1 registers */
#define RSPI1_CR1       reg16(0x40013000) /*!< SPI control register 1 (not used in I2S mode),      Address offset: 0x00 */
#define RSPI1_CR2       reg16(0x40013004) /*!< SPI control register 2,                             Address offset: 0x04 */
#define RSPI1_SR        reg16(0x40013008) /*!< SPI status register,                                Address offset: 0x08 */
#define RSPI1_DR        reg16(0x4001300C) /*!< SPI data register,                                  Address offset: 0x0C */
#define RSPI1_CRCPR     reg16(0x40013010) /*!< SPI CRC polynomial register (not used in I2S mode), Address offset: 0x10 */
#define RSPI1_RXCRCR    reg16(0x40013014) /*!< SPI RX CRC register (not used in I2S mode),         Address offset: 0x14 */
#define RSPI1_TXCRCR    reg16(0x40013018) /*!< SPI TX CRC register (not used in I2S mode),         Address offset: 0x18 */
#define RSPI1_I2SCFGR   reg16(0x4001301C) /*!< SPI_I2S configuration register,                     Address offset: 0x1C */
#define RSPI1_I2SPR     reg16(0x40013020) /*!< SPI_I2S prescaler register,                         Address offset: 0x20 */

#define RSPI2_CR1       reg16(0x40003800) /*!< SPI control register 1 (not used in I2S mode),      Address offset: 0x00 */
#define RSPI2_CR2       reg16(0x40003804) /*!< SPI control register 2,                             Address offset: 0x04 */
#define RSPI2_SR        reg16(0x40003808) /*!< SPI status register,                                Address offset: 0x08 */
#define RSPI2_DR        reg16(0x4000380C) /*!< SPI data register,                                  Address offset: 0x0C */
#define RSPI2_CRCPR     reg16(0x40003810) /*!< SPI CRC polynomial register (not used in I2S mode), Address offset: 0x10 */
#define RSPI2_RXCRCR    reg16(0x40003814) /*!< SPI RX CRC register (not used in I2S mode),         Address offset: 0x14 */
#define RSPI2_TXCRCR    reg16(0x40003818) /*!< SPI TX CRC register (not used in I2S mode),         Address offset: 0x18 */
#define RSPI2_I2SCFGR   reg16(0x4000381C) /*!< SPI_I2S configuration register,                     Address offset: 0x1C */
#define RSPI2_I2SPR     reg16(0x40003820) /*!< SPI_I2S prescaler register,                         Address offset: 0x20 */

#define RSPI3_CR1       reg16(0x40003c00) /*!< SPI control register 1 (not used in I2S mode),      Address offset: 0x00 */
#define RSPI3_CR2       reg16(0x40003c04) /*!< SPI control register 2,                             Address offset: 0x04 */
#define RSPI3_SR        reg16(0x40003c08) /*!< SPI status register,                                Address offset: 0x08 */
#define RSPI3_DR        reg16(0x40003c0C) /*!< SPI data register,                                  Address offset: 0x0C */
#define RSPI3_CRCPR     reg16(0x40003c10) /*!< SPI CRC polynomial register (not used in I2S mode), Address offset: 0x10 */
#define RSPI3_RXCRCR    reg16(0x40003c14) /*!< SPI RX CRC register (not used in I2S mode),         Address offset: 0x14 */
#define RSPI3_TXCRCR    reg16(0x40003c18) /*!< SPI TX CRC register (not used in I2S mode),         Address offset: 0x18 */
#define RSPI3_I2SCFGR   reg16(0x40003c1C) /*!< SPI_I2S configuration register,                     Address offset: 0x1C */
#define RSPI3_I2SPR     reg16(0x40003c20) /*!< SPI_I2S prescaler register,                         Address offset: 0x20 */


#endif /* _STM32G0B1X_ */
